Repository: F7s/ShellCommandManager
Catalog: App1/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# MainWindow.Title
source: Shell Command Manager
zh_cn: Shell 命令管理器

# TitleText.Text
source: Shell Command Manager
zh_cn: Shell 命令管理器

# ToggleEditorButton.Label
source: Add Command
zh_cn: 添加命令

# SaveCommandAppBarButton.Label
source: Save Command
zh_cn: 保存命令

# RunSelectedAppBarButton.Label
source: Run Selected
zh_cn: 运行所选

# DeleteSelectedAppBarButton.Label
source: Delete Selected
zh_cn: 删除所选

# ClearInputAppBarButton.Label
source: Clear Inputs
zh_cn: 清空输入

# EditorTitleTextBlock.Text
source: Command Configuration
zh_cn: 命令配置

# TemplateLabelTextBlock.Text
source: Command Template
zh_cn: 命令模板

# TemplateComboBox.PlaceholderText
source: Select an imported template
zh_cn: 选择已导入模板

# ImportTemplateButton.Content
source: Import Template
zh_cn: 导入模板

# ImportTemplateCodeButton.Content
source: Import Code
zh_cn: 代码导入

# ClearTemplateButton.Content
source: Clear Template
zh_cn: 清空模板

# NameLabelTextBlock.Text
source: Name
zh_cn: 名称

# NameTextBox.PlaceholderText
source: e.g. Start API Service
zh_cn: 例如：启动 API 服务

# CommandLabelTextBlock.Text
source: PowerShell Command
zh_cn: PowerShell 命令

# CommandTextBox.PlaceholderText
source: e.g. dotnet run --project .\Api\Api.csproj
zh_cn: 例如：dotnet run --project .\Api\Api.csproj

# ManualArgsLabelTextBlock.Text
source: Startup Arguments (appended after command)
zh_cn: 启动参数（会附加到命令后）

# ArgsTextBox.PlaceholderText
source: e.g. --environment Development
zh_cn: 例如：--environment Development

# TemplateArgsLabelTextBlock.Text
source: Template Arguments
zh_cn: 模板参数

# WorkingDirectoryLabelTextBlock.Text
source: Working Directory (optional)
zh_cn: 工作目录（可选）

# WorkingDirectoryTextBox.PlaceholderText
source: e.g. C:\Projects\MyApp
zh_cn: 例如：C:\Projects\MyApp

# SavedCommandsTitleTextBlock.Text
source: Saved Commands
zh_cn: 已保存命令

# SavedCommandsHintTextBlock.Text
source: Select to run directly, or edit and click Save Command to overwrite.
zh_cn: 选中后可直接运行，也可编辑后点击“保存命令”覆盖更新。

# AppBar.AddCommand
source: Add Command
zh_cn: 添加命令

# AppBar.CollapseAdd
source: Collapse Add
zh_cn: 收起添加

# Status.CommandsLoaded
source: Loaded {0} commands.
zh_cn: 已加载 {0} 条命令。

# Status.LoadCommandsFailed
source: Failed to load commands: {0}
zh_cn: 加载命令失败：{0}

# Status.LoadCommandsFailedSimple
source: Failed to load commands. Please check command storage.
zh_cn: 加载命令失败，请检查命令配置文件。

# Status.LoadTemplatesFailed
source: Failed to load templates: {0}
zh_cn: 加载模板失败：{0}

# Status.LoadTemplatesFailedSimple
source: Failed to load templates. Please check template format.
zh_cn: 加载模板失败，请检查模板文件格式。

# Status.CommandAdded
source: Command added. You can continue adding another one.
zh_cn: 已新增命令，可继续添加下一条。

# Status.CommandUpdated
source: Command updated.
zh_cn: 已更新命令。

# Status.SelectBeforeDelete
source: Please select a command before deleting.
zh_cn: 请先选择一条命令再删除。

# Status.CommandDeleted
source: Command deleted.
zh_cn: 已删除命令。

# Status.RunningCommand
source: Running: {0}
zh_cn: 正在运行：{0}

# Status.CommandStartedWithPid
source: Started in PowerShell window: {0} (PID: {1})
zh_cn: 已在 PowerShell 窗口启动：{0} (PID: {1})

# Status.RunFailed
source: Execution failed: {0}
zh_cn: 执行失败：{0}

# Status.RunFailedSimple
source: Execution failed. Please verify command and arguments.
zh_cn: 执行失败，请检查命令与参数后重试。

# Status.EditorCleared
source: Input area cleared.
zh_cn: 输入区域已清空。

# Status.TemplateImported
source: Template imported: {0}
zh_cn: 模板导入成功：{0}

# Status.ImportTemplateFailed
source: Template import failed: {0}
zh_cn: 导入模板失败：{0}

# Status.ImportTemplateFailedSimple
source: Template import failed. Please validate JSON/YAML structure.
zh_cn: 导入模板失败，请检查 JSON/YAML 结构。

# Status.ImportTemplateCodeFailed
source: Code import failed: {0}
zh_cn: 代码导入失败：{0}

# Status.ImportTemplateCodeFailedSimple
source: Code import failed. Please validate pasted content.
zh_cn: 代码导入失败，请检查粘贴内容格式。

# Dialog.ImportTemplateCode.Placeholder
source: Paste JSON/YAML template content
zh_cn: 粘贴 JSON/YAML 模板内容

# Dialog.ImportTemplateCode.Title
source: Import Template from Code
zh_cn: 代码导入模板

# Dialog.ImportTemplateCode.ImportButton
source: Import
zh_cn: 导入

# Dialog.ImportTemplateCode.CancelButton
source: Cancel
zh_cn: 取消

source: Template applied
zh_cn: 已应用模板

# TemplateArg.AskBeforeRun
source: Ask before run
zh_cn: 运行前询问

# Common.SelectFile
source: Select File
zh_cn: 选择文件

# Common.SelectFolder
source: Select Folder
zh_cn: 选择文件夹

# Common.History
source: History
zh_cn: 历史

# Common.NoHistory
source: No history
zh_cn: 暂无历史

# Validation.NameRequired
source: Name is required.
zh_cn: 名称不能为空。

# Validation.CommandRequired
source: PowerShell command is required.
zh_cn: PowerShell 命令不能为空。

# Validation.WorkingDirectoryNotFound
source: Working directory does not exist. Please check the path.
zh_cn: 工作目录不存在，请检查路径。

# Validation.TemplateControlMissing
source: Template input control missing: {0}
zh_cn: 模板参数控件缺失：{0}

# Validation.ArgumentRequired
source: Argument "{0}" is required.
zh_cn: 参数“{0}”为必填。

# Validation.ArgumentMustBeNumber
source: Argument "{0}" must be a number.
zh_cn: 参数“{0}”必须是数字。

# Validation.ArgumentMustSelect
source: Argument "{0}" must select an option.
zh_cn: 参数“{0}”必须选择一个选项。

# Dialog.RuntimeArgs.Title
source: Runtime Parameters
zh_cn: 运行前参数

# Dialog.RuntimeArgs.RunButton
source: Run
zh_cn: 运行

# Dialog.RuntimeArgs.CancelButton
source: Cancel
zh_cn: 取消
